IDENTIFICATION DIVISION.
PROGRAM-ID.    HELLO-WORLD.
*>              hello, world
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
DATA           DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC X(15) VALUE 'World'.
PROCEDURE      DIVISION.
0000-main-logic.
PERFORM 1000-get-name.
PERFORM 2000-display-name.
STOP RUN.

1000-get-name.
DISPLAY 'What is your name?'.
ACCEPT WS-NAME FROM CONSOLE.

2000-display-name.
DISPLAY 'Hello 'WS-NAME'!'.
